In [3]:
import pandas as pd
import sqlite3

# 9.1 从SQL中读数据

**前面讲的都是从csv里面读数据，pandas其实可以从很多数据方式里面读数据，比如HTML, JSON, SQL, EXCEL, HDF5， Stata等等。这次我们讲讲从SQL中读数据**

**可以用read_sql来读取数据，它会自动的将SQL的列转换成数据框架的列名**

**read_sql需要两个声明：一个SELECT，一个数据框架连接对象。这意味着你可以从任何的数据库中读取，包括MySQL, SQLite, PostgreSQL等等。**

In [5]:
con = sqlite3.connect("data/weather_2012.sqlite")
df = pd.read_sql("SELECT * from weather_2012 LIMIT 3", con)
df

   id            date_time  temp
0   1  2012-01-01 00:00:00  -1.8
1   2  2012-01-01 01:00:00  -1.8
2   3  2012-01-01 02:00:00  -1.8

**read_sql并不会将id默认为dataframe的index，你可以通过添加index_col来让id成为index.**

In [6]:
df = pd.read_sql("SELECT * from weather_2012 LIMIT 3", con, index_col='id')
df

              date_time  temp
id
1   2012-01-01 00:00:00  -1.8
2   2012-01-01 01:00:00  -1.8
3   2012-01-01 02:00:00  -1.8

**也可以给index_col一系列数值**

In [7]:
df = pd.read_sql("SELECT * from weather_2012 LIMIT 3", con, 
                 index_col=['id', 'date_time'])
df

                        temp
id date_time
1  2012-01-01 00:00:00  -1.8
2  2012-01-01 01:00:00  -1.8
3  2012-01-01 02:00:00  -1.8

# 9.2 将数据写入SQL

**pandas有write_frame函数来从dataframe创建一个database.目前只对SQLite有效，现在我们把weather_2012的data放进SQL**

In [9]:
weather_df = pd.read_csv('data/weather_2012.csv')
con = sqlite3.connect("data/test_db.sqlite")
con.execute("DROP TABLE IF EXISTS weather_2012")
weather_df.to_sql("weather_2012", con)

D:\MachineLearning\Anaconda3\envs\tensorflow\lib\site-packages\pandas\core\generic.py:1362: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  chunksize=chunksize, dtype=dtype)

In [11]:
con = sqlite3.connect("data/test_db.sqlite")
df = pd.read_sql("SELECT * from weather_2012 LIMIT 3", con)
df

,index,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
0,0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8.0,101.24,Fog
1,1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8.0,101.24,Fog
2,2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4.0,101.26,"Freezing Drizzle,Fog"